{
  "workflow_definition": {
    "title": "GovS 015: Grants - Digital Caseworking System Workflow Definition",
    "overview": "This JSON defines the workflow for the grant application process, structured around the principles of GovS 015: Grants. It details the interaction between an internal digital caseworking system and an external Grant Application Service, and how key information is shared with the Government Grants Information System (GGIS).",
    "phases": [
      {
        "name": "Phase 1: Pre-Application & Design",
        "description": "This phase involves the strategic planning, design, and preparation of the grant scheme, including configuring both the internal digital caseworking system and the external Grant Application Service, before it is opened for applications.",
        "stages": [
          {
            "name": "Stage 1.1: Scheme Design & Policy Development",
            "description": "Defining the grant scheme's objectives, scope, eligibility criteria, and policy framework, with configuration considerations for both the internal digital caseworking system and the external Grant Application Service.",
            "stage_actions": [
              {
                "action": "Develop Grant Policy & Objectives",
                "tasks": [
                  "Identify policy need and desired outcomes.",
                  "Define grant scheme objectives and strategic alignment.",
                  "Determine target beneficiaries and eligibility criteria.",
                  "Establish funding priorities and allocation strategy.",
                  "Define data fields and logical rules for the Grant Application Service's external application form."
                ],
                "relevant_permissions_roles": [
                  "Grant Policy Lead (GPL)",
                  "Grant Scheme Owner (GSO)"
                ],
                "civil_service_grade": "SCS1 (GSO), G7 (GPL)",
                "information_informed_to_ggis": {
                  "Scheme Name": null,
                  "Scheme Objectives": null,
                  "Policy Area": null,
                  "Target Beneficiaries": null,
                  "Anticipated Funding Amount": null,
                  "Scheme Eligibility Criteria (summary for GGIS)": null
                }
              },
              {
                "action": "Design Scheme Mechanics",
                "tasks": [
                  "Determine application process (e.g., single-stage, multi-stage).",
                  "Design Grant Application Service's digital application form workflow and required digital documentation for applicants.",
                  "Develop assessment criteria and scoring methodology for online assessment tools within the internal digital caseworking system.",
                  "Define monitoring and reporting requirements for successful applicants, including digital submission formats via the Grant Application Service.",
                  "Draft grant agreement template for digital signing.",
                  "Conduct risk assessment and mitigation planning, informing system controls.",
                  "Develop communication plan for digital channels.",
                  "Configure assessment modules and scoring logic within the internal digital caseworking system.",
                  "Define workflows for notifications, escalations, and approvals within the internal digital caseworking system."
                ],
                "relevant_permissions_roles": [
                  "GPL",
                  "Grant Manager (GM)",
                  "Legal Advisor",
                  "Digital System Administrator"
                ],
                "civil_service_grade": "G7 (GPL, GM), SEO (GM), HEO (GM support), SEO (Digital System Admin)",
                "information_informed_to_ggis": {
                  "Scheme Application Process Type": null,
                  "Scheme Assessment Criteria (summary)": null,
                  "Scheme Monitoring Requirements (summary)": null,
                  "Scheme Reporting Requirements (summary)": null,
                  "Scheme Key Risk Indicators (summary)": null
                }
              }
            ]
          },
          {
            "name": "Stage 1.2: Scheme Approval & Publication Preparation",
            "description": "Obtaining necessary approvals for the grant scheme and preparing for its public launch via the external Grant Application Service.",
            "stage_actions": [
              {
                "action": "Secure Internal Approvals",
                "tasks": [
                  "Present scheme design to relevant governance boards/committees, using digital review platforms.",
                  "Obtain financial, legal, and policy approvals through digital sign-off processes.",
                  "Confirm budget allocation in financial systems."
                ],
                "relevant_permissions_roles": [
                  "GSO",
                  "Finance Approver",
                  "Legal Advisor"
                ],
                "civil_service_grade": "SCS1 (GSO), G6 (Finance Approver), G7 (Legal Advisor)",
                "information_informed_to_ggis": {
                  "Scheme Approval Status": null,
                  "Scheme Approval Date": null,
                  "Approved Budget": null,
                  "Approving Authority (digital ID)": null
                }
              },
              {
                "action": "Prepare for Digital Publication",
                "tasks": [
                  "Finalise digital guidance for applicants.",
                  "Prepare promotional materials for online platforms (e.g., website content, social media).",
                  "Configure and test the Grant Application Service (public-facing portal).",
                  "Define application window dates in the system.",
                  "Ensure Grant Application Service is ready for public access and application intake, with integration to the internal digital caseworking system."
                ],
                "relevant_permissions_roles": [
                  "GM",
                  "Communications Team",
                  "Digital System Administrator"
                ],
                "civil_service_grade": "HEO (GM), EO (GM support), SEO (Digital System Admin)",
                "information_informed_to_ggis": {
                  "Scheme Publication Date": null,
                  "Application Start Date": null,
                  "Application End Date": null,
                  "Application Portal URL (from Grant Application Service)": null
                }
              }
            ]
          }
        ]
      },
      {
        "name": "Phase 2: Application & Assessment",
        "description": "This phase covers the period when applications are submitted externally via the Grant Application Service, then reviewed, and assessed within the internal digital caseworking system against the scheme's criteria.",
        "stages": [
          {
            "name": "Stage 2.1: Application Submission",
            "description": "Applicants submit their proposals through the external Grant Application Service.",
            "stage_actions": [
              {
                "action": "Receive Applications (Digital)",
                "tasks": [
                  "Grant Application Service goes live.",
                  "Applicants submit proposals electronically via the external Grant Application Service.",
                  "Grant Application Service provides automated acknowledgement of receipt.",
                  "Grant Application Service performs initial automated validation (e.g., mandatory fields) and routes applications to the internal digital caseworking system.",
                  "Applications are automatically logged and assigned a unique ID within the internal digital caseworking system (mirroring or linking to Grant Application Service ID).",
                  "Provide digital support to applicants for system navigation via the Grant Application Service."
                ],
                "relevant_permissions_roles": [
                  "Applicant (External)",
                  "Grant Application Service",
                  "Internal Digital Caseworking System",
                  "GM (monitoring)"
                ],
                "civil_service_grade": "HEO (GM for support), EO (GM support)",
                "information_informed_to_ggis": {
                  "Application ID": "(from internal digital caseworking system)",
                  "Scheme ID": "(linked)",
                  "Applicant Organisation Name": null,
                  "Applicant Contact Details (summary)": null,
                  "Date/Time of Submission": null,
                  "Application Status: Submitted": "(from internal digital caseworking system)",
                  "Summary of Application Request (e.g., requested amount, project title)": null,
                  "Internal Digital Caseworking System Application Record Link": null
                }
              }
            ]
          },
          {
            "name": "Stage 2.2: Initial Eligibility & Due Diligence Checks",
            "description": "Screening applications for basic eligibility and conducting preliminary due diligence, largely automated within the internal digital caseworking system.",
            "stage_actions": [
              {
                "action": "Conduct Eligibility Checks (Automated & Manual)",
                "tasks": [
                  "Internal digital caseworking system automatically runs pre-configured eligibility rules against submitted data from the Grant Application Service.",
                  "Review flagged applications for manual verification within the internal system.",
                  "Internal digital caseworking system marks applications as compliant or non-compliant based on rules."
                ],
                "relevant_permissions_roles": [
                  "GM",
                  "Internal Digital Caseworking System"
                ],
                "civil_service_grade": "HEO (GM), EO (GM support)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Eligibility Check Outcome": "(Pass/Fail)",
                  "Application Status: Under Review (Eligibility/Due Diligence)": null
                }
              },
              {
                "action": "Perform Due Diligence (Integrated Initial)",
                "tasks": [
                  "Internal digital caseworking system initiates checks with external data sources (e.g., Companies House API) for basic financial health.",
                  "Conduct internal conflict of interest checks within the internal system.",
                  "Review internal digital caseworking system records for previous adverse findings or compliance issues.",
                  "Internal digital caseworking system consolidates initial due diligence findings on the application record."
                ],
                "relevant_permissions_roles": [
                  "GM",
                  "Finance Team (support)",
                  "Internal Digital Caseworking System"
                ],
                "civil_service_grade": "HEO (GM)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Initial Due Diligence Status": "(e.g., 'Complete', 'Pending', 'Flagged')",
                  "Risk Flags (summary for GGIS, e.g., 'High Financial Risk')": null
                }
              }
            ]
          },
          {
            "name": "Stage 2.3: Application Assessment & Scoring",
            "description": "Detailed evaluation of eligible applications using online assessment tools and structured scoring within the internal digital caseworking system.",
            "stage_actions": [
              {
                "action": "Assign Assessors (Digital)",
                "tasks": [
                  "GM assigns applications to qualified assessors directly within the internal digital caseworking system.",
                  "Internal digital caseworking system facilitates conflict of interest declarations for assessors."
                ],
                "relevant_permissions_roles": [
                  "GM"
                ],
                "civil_service_grade": "HEO (GM)",
                "information_informed_to_ggis": "No specific GGIS update required at this task level, as this is internal caseworking detail."
              },
              {
                "action": "Conduct Assessment (Online)",
                "tasks": [
                  "Assessors review application content and input scores directly into the internal digital caseworking system using predefined criteria.",
                  "Internal digital caseworking system automatically calculates total scores.",
                  "Assessors provide written feedback and justification within dedicated system fields."
                ],
                "relevant_permissions_roles": [
                  "Assessor (Internal/External)"
                ],
                "civil_service_grade": "G7 (Internal Assessor), SEO (Internal Assessor)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Overall Assessment Score": "(if relevant for GGIS public transparency, e.g., bandings)",
                  "Application Status: Assessed": null
                }
              },
              {
                "action": "Moderation & Consensus (System-Aided)",
                "tasks": [
                  "Internal digital caseworking system provides tools for comparing individual assessments for consistency.",
                  "Facilitate virtual moderation meetings using internal digital caseworking system data.",
                  "Input final moderated scores and notes directly into the internal digital caseworking system.",
                  "Internal digital caseworking system locks final assessment outcomes."
                ],
                "relevant_permissions_roles": [
                  "GM",
                  "Senior Assessor"
                ],
                "civil_service_grade": "G7 (GM, Senior Assessor)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Final Assessment Outcome": "(e.g., 'Recommended for Funding', 'Not Recommended')"
                }
              }
            ]
          },
          {
            "name": "Stage 2.4: Recommendation & Decision",
            "description": "Compiling assessment results and making recommendations for funding, leading to a final digital decision and recording within the internal caseworking system.",
            "stage_actions": [
              {
                "action": "Prepare Funding Recommendations (System-Generated)",
                "tasks": [
                  "Internal digital caseworking system generates ranked lists of applications based on moderated scores.",
                  "Review budget availability and strategic fit within the system context.",
                  "Draft recommendation report within the internal digital caseworking system or using system-exported data."
                ],
                "relevant_permissions_roles": [
                  "GM",
                  "GPL"
                ],
                "civil_service_grade": "G7 (GM, GPL)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Recommended Funding Amount": null,
                  "Application Status: Recommended": null
                }
              },
              {
                "action": "Grant Decision (Digital Approval)",
                "tasks": [
                  "Decision-makers review recommendations and supporting data in the internal digital caseworking system.",
                  "Approve, reject, or request further information via digital approval workflows within the internal system.",
                  "Internal digital caseworking system automatically records the final decision, decision date, and decision-maker."
                ],
                "relevant_permissions_roles": [
                  "GSO",
                  "Finance Approver"
                ],
                "civil_service_grade": "SCS1 (GSO), G6 (Finance Approver)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Final Decision (Approved/Rejected/Conditional)": null,
                  "Approved Grant Amount": "(if approved)",
                  "Decision Date": null,
                  "Decision Maker ID": null,
                  "Reason for Decision (if rejected, high-level summary for GGIS)": null,
                  "Application Status: Decision Made": null
                }
              }
            ]
          }
        ]
      },
      {
        "name": "Phase 3: Award & Agreement",
        "description": "This phase involves formally notifying successful applicants digitally via the Grant Application Service, drafting and digitally signing grant agreements, and setting up payment schedules within integrated financial systems, with GGIS being informed of the grant award.",
        "stages": [
          {
            "name": "Stage 3.1: Notification & Offer",
            "description": "Informing applicants of the decision and, for successful ones, issuing the grant offer via the external Grant Application Service.",
            "stage_actions": [
              {
                "action": "Notify Applicants (Automated & Digital)",
                "tasks": [
                  "Internal digital caseworking system triggers the Grant Application Service to send formal digital notification letters (success/unsuccessful) via integrated email/portal.",
                  "Provide digital feedback to unsuccessful applicants via the Grant Application Service (if policy allows)."
                ],
                "relevant_permissions_roles": [
                  "GM (trigger)",
                  "Internal Digital Caseworking System",
                  "Grant Application Service"
                ],
                "civil_service_grade": "HEO (GM)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Notification Sent Date": null,
                  "Application Status: Offer Issued": null
                }
              },
              {
                "action": "Issue Grant Offer (Digital)",
                "tasks": [
                  "Prepare and issue the formal digital grant offer letter, including terms and conditions, accessible via the Grant Application Service.",
                  "Set deadline for digital acceptance within the Grant Application Service."
                ],
                "relevant_permissions_roles": [
                  "GM"
                ],
                "civil_service_grade": "HEO (GM)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Proposed Grant Amount": null
                }
              }
            ]
          },
          {
            "name": "Stage 3.2: Grant Agreement Finalisation",
            "description": "Negotiating (if necessary) and finalising the grant agreement through digital means, using the Grant Application Service for applicant interaction.",
            "stage_actions": [
              {
                "action": "Negotiate & Amend (Digital, if required)",
                "tasks": [
                  "Address any queries or proposed amendments from the applicant via the Grant Application Service's messaging/workflow, routing to the internal digital caseworking system.",
                  "Consult legal/policy teams for significant changes, with digital record of advice in the internal system.",
                  "Update agreement within the internal digital caseworking system or issue digital addendums via the Grant Application Service."
                ],
                "relevant_permissions_roles": [
                  "GM",
                  "Legal Advisor",
                  "Applicant (External)"
                ],
                "civil_service_grade": "HEO (GM), G7 (Legal Advisor)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Negotiation Status": "(e.g., 'In Progress', 'Completed')",
                  "Revised Grant Amount": "(if applicable)"
                }
              },
              {
                "action": "Sign Grant Agreement (Electronic Signature)",
                "tasks": [
                  "Obtain electronic signatures from both the grant-making organisation and the recipient via an integrated e-signature platform, accessed through the Grant Application Service.",
                  "Store digitally signed agreement securely within the internal digital caseworking system."
                ],
                "relevant_permissions_roles": [
                  "GSO (for organisation)",
                  "Applicant (External)"
                ],
                "civil_service_grade": "SCS1 (GSO)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Grant Agreement Signed Date": null,
                  "Final Awarded Grant Amount": null,
                  "Grant Start Date": null,
                  "Grant End Date": null,
                  "Application Status: Agreement Signed": null,
                  "Internal Digital Caseworking System Grant Record Link": "(for auditing/detailed lookup in GGIS)"
                }
              }
            ]
          },
          {
            "name": "Stage 3.3: Setup & Initial Payment",
            "description": "Setting up the grant in financial systems and initiating the first payment, often with automated integration from the internal digital caseworking system.",
            "stage_actions": [
              {
                "action": "Financial System Setup (Automated Integration)",
                "tasks": [
                  "Internal digital caseworking system automatically pushes grant details to the financial management system.",
                  "Financial system creates new grant record and sets up payment schedule/milestones based on internal digital caseworking system data.",
                  "Manual verification of data transfer."
                ],
                "relevant_permissions_roles": [
                  "Finance Team",
                  "GM",
                  "Internal Digital Caseworking System"
                ],
                "civil_service_grade": "EO (Finance Team), HEO (GM)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Payment Schedule (dates, amounts - high level for GGIS)": null
                }
              },
              {
                "action": "Process Initial Payment (Automated Trigger)",
                "tasks": [
                  "Internal digital caseworking system verifies conditions for first payment (e.g., signed agreement) and triggers payment request to the financial system.",
                  "Financial system authorises and processes initial payment based on internal digital caseworking system trigger.",
                  "Internal digital caseworking system sends automated notification to recipient of payment via the Grant Application Service."
                ],
                "relevant_permissions_roles": [
                  "Finance Team",
                  "GM (oversight)",
                  "Internal Digital Caseworking System",
                  "Grant Application Service"
                ],
                "civil_service_grade": "EO (Finance Team), HEO (GM)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Initial Payment Date": null,
                  "Initial Payment Amount": null,
                  "Payment Status: Paid": null,
                  "Cumulative Payments to Date": "(updated by internal digital caseworking system)"
                }
              }
            ]
          }
        ]
      },
      {
        "name": "Phase 4: Monitoring & Reporting",
        "description": "This phase involves overseeing the grant recipient's progress, ensuring compliance, and managing any changes or issues through the internal digital caseworking system, with applicant interaction via the Grant Application Service and GGIS being informed of key updates.",
        "stages": [
          {
            "name": "Stage 4.1: Performance Monitoring",
            "description": "Tracking the grant recipient's progress against agreed objectives and deliverables using digital reporting and monitoring tools within the internal digital caseworking system.",
            "stage_actions": [
              {
                "action": "Receive Digital Progress Reports",
                "tasks": [
                  "Recipients submit periodic progress reports via the Grant Application Service portal using structured forms, which are then stored in the internal digital caseworking system.",
                  "Internal digital caseworking system provides automated reminders for overdue reports via the Grant Application Service.",
                  "Review reports for completeness and accuracy within the internal system."
                ],
                "relevant_permissions_roles": [
                  "GM",
                  "Applicant (External)",
                  "Grant Application Service",
                  "Internal Digital Caseworking System"
                ],
                "civil_service_grade": "HEO (GM)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Latest Report Submission Date": null,
                  "Overall Performance Status": "(e.g., 'On Track', 'Amber', 'Red' - derived from internal digital system)"
                }
              },
              {
                "action": "Performance Review & Feedback (Digital)",
                "tasks": [
                  "Assess performance against KPIs and objectives using internal digital caseworking system dashboards and data analytics.",
                  "Provide feedback to recipient via the Grant Application Service portal.",
                  "Identify any underperformance or issues, generating system alerts in the internal system."
                ],
                "relevant_permissions_roles": [
                  "GM"
                ],
                "civil_service_grade": "HEO (GM), G7 (for complex issues)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Last GM Assessment Date": null,
                  "Performance Risk Rating": "(from internal digital system)"
                }
              }
            ]
          },
          {
            "name": "Stage 4.2: Financial Reporting & Payments",
            "description": "Managing digital financial claims, verifying expenditure within the internal system, and processing subsequent automated payments.",
            "stage_actions": [
              {
                "action": "Receive Digital Financial Claims",
                "tasks": [
                  "Recipients submit financial claims/invoices via the Grant Application Service portal.",
                  "Grant Application Service facilitates upload and linking of supporting digital documentation, routing to the internal digital caseworking system."
                ],
                "relevant_permissions_roles": [
                  "GM",
                  "Applicant (External)",
                  "Grant Application Service",
                  "Internal Digital Caseworking System"
                ],
                "civil_service_grade": "HEO (GM)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Latest Claim Period": null
                }
              },
              {
                "action": "Verify Expenditure & Process Payments (System-Driven)",
                "tasks": [
                  "Review expenditure against agreed budget lines within the internal digital caseworking system.",
                  "Internal digital caseworking system integrates with financial system to authorise and process payments based on verified claims and performance conditions."
                ],
                "relevant_permissions_roles": [
                  "Finance Team",
                  "GM"
                ],
                "civil_service_grade": "EO (Finance Team), HEO (GM)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Latest Payment Date": null,
                  "Latest Payment Amount": null,
                  "Cumulative Payments to Date": "(updated by internal digital caseworking system)",
                  "Total Verified Expenditure to Date": "(updated by internal digital caseworking system)"
                }
              }
            ]
          },
          {
            "name": "Stage 4.3: Grant Management & Changes",
            "description": "Handling digital variation requests, issues, and compliance matters during the grant period through the internal caseworking system, with applicant interaction via the Grant Application Service.",
            "stage_actions": [
              {
                "action": "Manage Variations/Amendments (Digital Workflow)",
                "tasks": [
                  "Recipients submit requests for changes (e.g., scope, budget, timeline) via the Grant Application Service workflow, routing to the internal digital caseworking system.",
                  "Internal digital caseworking system routes requests for assessment of impact and necessary digital approvals.",
                  "Draft and issue digital grant amendment letters/addendums via the internal digital caseworking system, with communication through the Grant Application Service."
                ],
                "relevant_permissions_roles": [
                  "GM",
                  "GPL",
                  "Legal Advisor",
                  "Grant Application Service"
                ],
                "civil_service_grade": "HEO (GM), G7 (GPL, Legal Advisor)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Latest Variation Type": null,
                  "Latest Variation Approval Date": null
                }
              },
              {
                "action": "Address Compliance & Issues (Caseworking)",
                "tasks": [
                  "Investigate any compliance breaches or issues, logging details in the internal digital caseworking system.",
                  "Implement corrective actions or recovery procedures, tracking progress in the internal digital caseworking system.",
                  "Escalate significant issues to SRO/GSO via internal digital caseworking system escalation pathways.",
                  "Internal digital caseworking system provides alerts for impending compliance deadlines or breaches."
                ],
                "relevant_permissions_roles": [
                  "GM",
                  "Legal Advisor",
                  "Internal Audit"
                ],
                "civil_service_grade": "G7 (GM), G6 (Internal Audit)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Current Compliance Status": "(e.g., 'Compliant', 'Minor Breach', 'Major Breach')",
                  "Any Major Issues Flagged": "(e.g., 'Fraud Alert', 'Breach of T&Cs' - high-level summary)"
                }
              }
            ]
          }
        ]
      },
      {
        "name": "Phase 5: Evaluation & Closure",
        "description": "This phase focuses on assessing the overall impact of the grant scheme using aggregated digital data from the internal caseworking system and formally closing out individual grants within that system, with GGIS being informed of final outcomes.",
        "stages": [
          {
            "name": "Stage 5.1: Scheme Evaluation",
            "description": "Assessing the overall effectiveness and impact of the grant scheme using aggregated digital data from the internal caseworking system.",
            "stage_actions": [
              {
                "action": "Conduct Evaluation (Data-Driven)",
                "tasks": [
                  "Collect final reports and performance data from all grant recipients via the Grant Application Service, which are then consolidated in the internal digital caseworking system.",
                  "Commission independent evaluation, providing access to internal digital caseworking system data extracts.",
                  "Analyse scheme-level outcomes against objectives using internal digital caseworking system reporting and analytics tools."
                ],
                "relevant_permissions_roles": [
                  "GPL",
                  "Evaluation Team",
                  "Digital System Analyst"
                ],
                "civil_service_grade": "G7 (Evaluation Team), SCS1 (GPL), HEO (Digital System Analyst)",
                "information_informed_to_ggis": {
                  "Scheme ID": null,
                  "Evaluation Report Link": "(uploaded to GGIS or linked from internal digital system)",
                  "Overall Scheme Outcomes (summary)": null,
                  "Key Lessons Learned for Scheme (summary)": null
                }
              }
            ]
          },
          {
            "name": "Stage 5.2: Grant Closure & Reconciliation",
            "description": "Formally closing individual grant agreements and reconciling all financial aspects within the internal digital system.",
            "stage_actions": [
              {
                "action": "Final Reporting & Reconciliation (Digital)",
                "tasks": [
                  "Receive and review final project report from recipient via the Grant Application Service, stored in the internal digital caseworking system.",
                  "Reconcile all payments against final expenditure within the internal digital caseworking system and financial systems.",
                  "Confirm all deliverables met based on system records."
                ],
                "relevant_permissions_roles": [
                  "GM",
                  "Finance Team",
                  "Applicant (External)",
                  "Grant Application Service"
                ],
                "civil_service_grade": "HEO (GM), EO (Finance Team)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Final Report Submission Date": null,
                  "Total Grant Paid (Final)": null,
                  "Total Verified Expenditure (Final)": null,
                  "Overpayment/Underpayment (if any, from internal digital system)": null
                }
              },
              {
                "action": "Formal Grant Closure (Automated)",
                "tasks": [
                  "Internal digital caseworking system triggers the Grant Application Service to issue a formal digital grant closure letter.",
                  "Internal digital caseworking system updates grant status to 'Closed' and locks the record.",
                  "Internal digital caseworking system automatically archives relevant documentation and data."
                ],
                "relevant_permissions_roles": [
                  "GM (trigger)",
                  "Internal Digital Caseworking System",
                  "Grant Application Service"
                ],
                "civil_service_grade": "HEO (GM)",
                "information_informed_to_ggis": {
                  "Application ID": null,
                  "Grant Closure Date": null,
                  "Final Grant Status: Closed": null,
                  "Deliverables Met Status": "(Final)",
                  "Internal Digital Caseworking System Record Archive Link": null
                }
              }
            ]
          },
          {
            "name": "Stage 5.3: Post-Closure Audit & Review",
            "description": "Conducting post-closure audits and reviews using system audit trails and data to ensure compliance and identify best practices for continuous improvement.",
            "stage_actions": [
              {
                "action": "Post-Closure Audit (System-Aided)",
                "tasks": [
                  "Conduct sample audits of closed grants, leveraging internal digital caseworking system audit trails and data.",
                  "Review financial records and compliance directly within the internal digital caseworking system and linked financial systems."
                ],
                "relevant_permissions_roles": [
                  "Internal Audit",
                  "Digital System Analyst"
                ],
                "civil_service_grade": "G6 (Internal Audit), HEO (Digital System Analyst)",
                "information_informed_to_ggis": {
                  "Scheme ID": "(or Application ID for specific audits)",
                  "Audit Status": "(e.g., 'Complete', 'Findings Identified')",
                  "Key Audit Findings (summary for GGIS)": null
                }
              },
              {
                "action": "Lessons Learned & Continuous Improvement (Data-Driven)",
                "tasks": [
                  "Document lessons learned from the entire grant lifecycle within the internal digital caseworking system's knowledge management.",
                  "Identify areas for process improvement for future schemes based on internal digital caseworking system performance data and feedback."
                ],
                "relevant_permissions_roles": [
                  "GPL",
                  "GM",
                  "GSO",
                  "Digital System Analyst"
                ],
                "civil_service_grade": "G7 (GPL, GM), SCS1 (GSO), HEO (Digital System Analyst)",
                "information_informed_to_ggis": {
                  "Scheme ID": null,
                  "Process Improvement Recommendations (summary for GGIS)": null,
                  "Lessons Learned Document Link": "(linked from internal digital system)"
                }
              }
            ]
          }
        ]
      }
    ]
  }
}
